Revit 2027 API
View.GetTemporaryViewPropertiesId Method
 When Temporary View Properties mode is in progress it provides view id that overrode settings for current view. Outside Temporary View Properties mode InvalidElementId will be returned.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId GetTemporaryViewPropertiesId()
Public Function GetTemporaryViewPropertiesId As ElementId
public:
ElementId^ GetTemporaryViewPropertiesId()
member GetTemporaryViewPropertiesId : unit -> ElementId
Return Value
ElementId
Remarks
 Returned ElementId might refer to element that was deleted. It will happen when Temporary View Properties mode was applied basing on template that next was deleted.
See Also
Reference
View Class
Autodesk.Revit.DB Namespace